/*
Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
class Program {
  static void Main() {
    int a, b;
    Console.Write("a = ");
    a = int.Parse(Console.ReadLine());
    Console.Write("b = ");
    b = int.Parse(Console.ReadLine());
    if(a > b)
        Console.WriteLine("max = "+a);
    else
        Console.WriteLine("max = "+b); 
  }
}
*/
